; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c4-s5-p11-a3)
(:domain logistics-strips)
(:objects a0 a1 a2 
          c0 c1 c2 c3 
          t0 t1 t2 t3 
          l0-0 l0-1 l0-2 l0-3 l0-4 l1-0 l1-1 l1-2 l1-3 l1-4 l2-0 l2-1 l2-2 l2-3 l2-4 l3-0 l3-1 l3-2 l3-3 l3-4 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l0-4)
    (in-city  l0-4 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l1-4)
    (in-city  l1-4 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l2-3)
    (in-city  l2-3 c2)
    (LOCATION l2-4)
    (in-city  l2-4 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l3-2)
    (in-city  l3-2 c3)
    (LOCATION l3-3)
    (in-city  l3-3 c3)
    (LOCATION l3-4)
    (in-city  l3-4 c3)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (at t0 l0-0)
    (at t1 l1-4)
    (at t2 l2-3)
    (at t3 l3-0)
    (at p0 l1-4)
    (at p1 l1-4)
    (at p2 l0-2)
    (at p3 l1-4)
    (at p4 l1-1)
    (at p5 l0-0)
    (at p6 l0-4)
    (at p7 l3-0)
    (at p8 l1-3)
    (at p9 l1-2)
    (at p10 l3-4)
    (at a0 l3-0)
    (at a1 l2-0)
    (at a2 l3-0)
)
(:goal
    (and
        (at p0 l2-0)
        (at p1 l0-4)
        (at p2 l1-4)
        (at p3 l3-1)
        (at p4 l2-1)
        (at p5 l2-4)
        (at p6 l2-4)
        (at p7 l2-2)
        (at p8 l1-0)
        (at p9 l1-3)
        (at p10 l3-0)
    )
)

  (:constraints
    (and
      (always (not (in p10 a0)))
      (always (not (in p10 a1)))
      (always (not (in p10 a2)))
      (always (not (in p8 a0)))
      (always (not (in p8 a1)))
      (always (not (in p8 a2)))
      (always (not (in p9 a0)))
      (always (not (in p9 a1)))
      (always (not (in p9 a2)))
    )
  )
)

; plan
1. (drive-truck t2 l2-3 l2-4 c2)
   deleted: (at t2 l2-3)
   added: (at t2 l2-4)
   goals met: 0 of 11
2. (load-airplane p7 a0 l3-0)
   deleted: (at p7 l3-0)
   added: (in p7 a0)
   goals met: 0 of 11
3. (load-truck p3 t1 l1-4)
   deleted: (at p3 l1-4)
   added: (in p3 t1)
   goals met: 0 of 11
4. (load-truck p1 t1 l1-4)
   deleted: (at p1 l1-4)
   added: (in p1 t1)
   goals met: 0 of 11
5. (load-truck p0 t1 l1-4)
   deleted: (at p0 l1-4)
   added: (in p0 t1)
   goals met: 0 of 11
6. (drive-truck t3 l3-0 l3-4 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-4)
   goals met: 0 of 11
7. (drive-truck t0 l0-0 l0-4 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-4)
   goals met: 0 of 11
8. (fly-airplane a1 l2-0 l1-0)
   deleted: (at a1 l2-0)
   added: (at a1 l1-0)
   goals met: 0 of 11
9. (fly-airplane a2 l3-0 l2-0)
   deleted: (at a2 l3-0)
   added: (at a2 l2-0)
   goals met: 0 of 11
10. (load-truck p10 t3 l3-4)
   deleted: (at p10 l3-4)
   added: (in p10 t3)
   goals met: 0 of 11
11. (drive-truck t1 l1-4 l1-3 c1)
   deleted: (at t1 l1-4)
   added: (at t1 l1-3)
   goals met: 0 of 11
12. (load-truck p6 t0 l0-4)
   deleted: (at p6 l0-4)
   added: (in p6 t0)
   goals met: 0 of 11
13. (fly-airplane a0 l3-0 l0-0)
   deleted: (at a0 l3-0)
   added: (at a0 l0-0)
   goals met: 0 of 11
14. (drive-truck t2 l2-4 l2-0 c2)
   deleted: (at t2 l2-4)
   added: (at t2 l2-0)
   goals met: 0 of 11
15. (fly-airplane a2 l2-0 l0-0)
   deleted: (at a2 l2-0)
   added: (at a2 l0-0)
   goals met: 0 of 11
16. (drive-truck t3 l3-4 l3-1 c3)
   deleted: (at t3 l3-4)
   added: (at t3 l3-1)
   goals met: 0 of 11
17. (load-truck p8 t1 l1-3)
   deleted: (at p8 l1-3)
   added: (in p8 t1)
   goals met: 0 of 11
18. (drive-truck t0 l0-4 l0-2 c0)
   deleted: (at t0 l0-4)
   added: (at t0 l0-2)
   goals met: 0 of 11
19. (load-airplane p5 a2 l0-0)
   deleted: (at p5 l0-0)
   added: (in p5 a2)
   goals met: 0 of 11
20. (load-truck p2 t0 l0-2)
   deleted: (at p2 l0-2)
   added: (in p2 t0)
   goals met: 0 of 11
21. (drive-truck t1 l1-3 l1-2 c1)
   deleted: (at t1 l1-3)
   added: (at t1 l1-2)
   goals met: 0 of 11
22. (drive-truck t3 l3-1 l3-0 c3)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 0 of 11
23. (fly-airplane a2 l0-0 l2-0)
   deleted: (at a2 l0-0)
   added: (at a2 l2-0)
   goals met: 0 of 11
24. (drive-truck t0 l0-2 l0-4 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-4)
   goals met: 0 of 11
25. (load-truck p9 t1 l1-2)
   deleted: (at p9 l1-2)
   added: (in p9 t1)
   goals met: 0 of 11
26. (unload-airplane p5 a2 l2-0)
   deleted: (in p5 a2)
   added: (at p5 l2-0)
   goals met: 0 of 11
27. (drive-truck t1 l1-2 l1-3 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-3)
   goals met: 0 of 11
28. (drive-truck t0 l0-4 l0-0 c0)
   deleted: (at t0 l0-4)
   added: (at t0 l0-0)
   goals met: 0 of 11
29. (unload-truck p9 t1 l1-3)
   deleted: (in p9 t1)
   added: (at p9 l1-3)
   goals met: 1 of 11
30. (unload-truck p6 t0 l0-0)
   deleted: (in p6 t0)
   added: (at p6 l0-0)
   goals met: 1 of 11
31. (unload-truck p2 t0 l0-0)
   deleted: (in p2 t0)
   added: (at p2 l0-0)
   goals met: 1 of 11
32. (drive-truck t1 l1-3 l1-1 c1)
   deleted: (at t1 l1-3)
   added: (at t1 l1-1)
   goals met: 1 of 11
33. (load-airplane p6 a0 l0-0)
   deleted: (at p6 l0-0)
   added: (in p6 a0)
   goals met: 1 of 11
34. (load-airplane p2 a0 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 a0)
   goals met: 1 of 11
35. (load-truck p4 t1 l1-1)
   deleted: (at p4 l1-1)
   added: (in p4 t1)
   goals met: 1 of 11
36. (fly-airplane a0 l0-0 l2-0)
   deleted: (at a0 l0-0)
   added: (at a0 l2-0)
   goals met: 1 of 11
37. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 1 of 11
38. (unload-airplane p7 a0 l2-0)
   deleted: (in p7 a0)
   added: (at p7 l2-0)
   goals met: 1 of 11
39. (unload-airplane p6 a0 l2-0)
   deleted: (in p6 a0)
   added: (at p6 l2-0)
   goals met: 1 of 11
40. (unload-truck p4 t1 l1-0)
   deleted: (in p4 t1)
   added: (at p4 l1-0)
   goals met: 1 of 11
41. (unload-truck p3 t1 l1-0)
   deleted: (in p3 t1)
   added: (at p3 l1-0)
   goals met: 1 of 11
42. (unload-truck p1 t1 l1-0)
   deleted: (in p1 t1)
   added: (at p1 l1-0)
   goals met: 1 of 11
43. (unload-truck p0 t1 l1-0)
   deleted: (in p0 t1)
   added: (at p0 l1-0)
   goals met: 1 of 11
44. (load-truck p7 t2 l2-0)
   deleted: (at p7 l2-0)
   added: (in p7 t2)
   goals met: 1 of 11
45. (load-truck p6 t2 l2-0)
   deleted: (at p6 l2-0)
   added: (in p6 t2)
   goals met: 1 of 11
46. (fly-airplane a0 l2-0 l1-0)
   deleted: (at a0 l2-0)
   added: (at a0 l1-0)
   goals met: 1 of 11
47. (unload-airplane p2 a0 l1-0)
   deleted: (in p2 a0)
   added: (at p2 l1-0)
   goals met: 1 of 11
48. (drive-truck t2 l2-0 l2-4 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-4)
   goals met: 1 of 11
49. (load-airplane p4 a1 l1-0)
   deleted: (at p4 l1-0)
   added: (in p4 a1)
   goals met: 1 of 11
50. (load-airplane p3 a1 l1-0)
   deleted: (at p3 l1-0)
   added: (in p3 a1)
   goals met: 1 of 11
51. (load-airplane p1 a1 l1-0)
   deleted: (at p1 l1-0)
   added: (in p1 a1)
   goals met: 1 of 11
52. (load-airplane p0 a1 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 a1)
   goals met: 1 of 11
53. (unload-truck p8 t1 l1-0)
   deleted: (in p8 t1)
   added: (at p8 l1-0)
   goals met: 2 of 11
54. (fly-airplane a0 l1-0 l2-0)
   deleted: (at a0 l1-0)
   added: (at a0 l2-0)
   goals met: 2 of 11
55. (load-truck p2 t1 l1-0)
   deleted: (at p2 l1-0)
   added: (in p2 t1)
   goals met: 2 of 11
56. (unload-truck p6 t2 l2-4)
   deleted: (in p6 t2)
   added: (at p6 l2-4)
   goals met: 3 of 11
57. (fly-airplane a1 l1-0 l3-0)
   deleted: (at a1 l1-0)
   added: (at a1 l3-0)
   goals met: 3 of 11
58. (unload-airplane p3 a1 l3-0)
   deleted: (in p3 a1)
   added: (at p3 l3-0)
   goals met: 3 of 11
59. (drive-truck t1 l1-0 l1-4 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-4)
   goals met: 3 of 11
60. (drive-truck t2 l2-4 l2-2 c2)
   deleted: (at t2 l2-4)
   added: (at t2 l2-2)
   goals met: 3 of 11
61. (unload-truck p10 t3 l3-0)
   deleted: (in p10 t3)
   added: (at p10 l3-0)
   goals met: 4 of 11
62. (unload-truck p2 t1 l1-4)
   deleted: (in p2 t1)
   added: (at p2 l1-4)
   goals met: 5 of 11
63. (unload-truck p7 t2 l2-2)
   deleted: (in p7 t2)
   added: (at p7 l2-2)
   goals met: 6 of 11
64. (fly-airplane a1 l3-0 l0-0)
   deleted: (at a1 l3-0)
   added: (at a1 l0-0)
   goals met: 6 of 11
65. (load-truck p3 t3 l3-0)
   deleted: (at p3 l3-0)
   added: (in p3 t3)
   goals met: 6 of 11
66. (drive-truck t2 l2-2 l2-4 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-4)
   goals met: 6 of 11
67. (drive-truck t3 l3-0 l3-1 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 6 of 11
68. (unload-airplane p1 a1 l0-0)
   deleted: (in p1 a1)
   added: (at p1 l0-0)
   goals met: 6 of 11
69. (fly-airplane a1 l0-0 l2-0)
   deleted: (at a1 l0-0)
   added: (at a1 l2-0)
   goals met: 6 of 11
70. (unload-truck p3 t3 l3-1)
   deleted: (in p3 t3)
   added: (at p3 l3-1)
   goals met: 7 of 11
71. (load-truck p1 t0 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 t0)
   goals met: 7 of 11
72. (drive-truck t2 l2-4 l2-0 c2)
   deleted: (at t2 l2-4)
   added: (at t2 l2-0)
   goals met: 7 of 11
73. (drive-truck t0 l0-0 l0-4 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-4)
   goals met: 7 of 11
74. (unload-airplane p4 a1 l2-0)
   deleted: (in p4 a1)
   added: (at p4 l2-0)
   goals met: 7 of 11
75. (unload-airplane p0 a1 l2-0)
   deleted: (in p0 a1)
   added: (at p0 l2-0)
   goals met: 8 of 11
76. (load-truck p5 t2 l2-0)
   deleted: (at p5 l2-0)
   added: (in p5 t2)
   goals met: 8 of 11
77. (unload-truck p1 t0 l0-4)
   deleted: (in p1 t0)
   added: (at p1 l0-4)
   goals met: 9 of 11
78. (load-truck p4 t2 l2-0)
   deleted: (at p4 l2-0)
   added: (in p4 t2)
   goals met: 9 of 11
79. (drive-truck t2 l2-0 l2-4 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-4)
   goals met: 9 of 11
80. (unload-truck p5 t2 l2-4)
   deleted: (in p5 t2)
   added: (at p5 l2-4)
   goals met: 10 of 11
81. (drive-truck t2 l2-4 l2-1 c2)
   deleted: (at t2 l2-4)
   added: (at t2 l2-1)
   goals met: 10 of 11
82. (unload-truck p4 t2 l2-1)
   deleted: (in p4 t2)
   added: (at p4 l2-1)
   goals met: 11 of 11
